src/InformationRegisters/аДокументооборотЗаменыИсполнителейВТочекПроцесса/аДокументооборотЗаменыИсполнителейВТочекПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотЗаменыИсполнителейВТочекПроцесса</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДействующийИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходныйИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаКБП</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.аДокументооборотТочкиКорпоративныхПроцессов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/аДокументооборотСсылкиПроцессов/аДокументооборотСсылкиПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотСсылкиПроцессов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/pcru_ЗадачиПоДокументам/pcru_ЗадачиПоДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>pcru_ЗадачиПоДокументам</name>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполненияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстовыйРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаПереадресации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.аДокументооборотКорпоративныйДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПереадресованоДругому</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Переадресант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/аДокументооборотМатрицаЗаместителей/аДокументооборотМатрицаЗаместителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотМатрицаЗаместителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЗаместительСотрудника</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Заместитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources extendedConfigurationObject="26917014-69cf-4289-bc74-4144458b8a38">
    <name>НачинатьЗаменуЕслиНетОтветаЧерезПериодов</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources extendedConfigurationObject="fac02b6c-8d3e-4ce7-80c0-607bba60b5ee">
    <name>ВидПериода</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗамены</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗамещаемыйСотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="508cd14c-2f96-460b-b94a-53a496dcb05d">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="b7219a7c-543c-4cc4-ae94-9f2e6f0bbc52">
    <name>ЗаменаНеАктуальна</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="527a81c9-ad5d-450e-a682-0810b0258b4c">
    <name>ТолькоДляВидаПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.аДокументооборотВидыПроцессов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/аДокументооборотЗаменыИсполнителейВТочекПроцесса/RecordSetModule.bsl
&После("ПриЗаписи")
Процедура Pcru_ПриЗаписи(Отказ, Замещение)
		Для каждого СтрокаНЗ Из ЭтотОбъект Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	аДокументооборотСсылкиПроцессов.Объект
		|ИЗ
		|	РегистрСведений.аДокументооборотСсылкиПроцессов КАК аДокументооборотСсылкиПроцессов
		|ГДЕ
		|	аДокументооборотСсылкиПроцессов.БизнесПроцесс = &БизнесПроцесс";
		Запрос.УстановитьПараметр("БизнесПроцесс",СтрокаНЗ.БизнесПроцесс);
		Выборка = Запрос.Выполнить().Выбрать();
		СписокОбъектов = Новый  СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СписокОбъектов.Добавить(Выборка.Объект);
			
			
			
			
			
		КонецЦикла;
		//
		Если СписокОбъектов.Количество() =0 Тогда
			Продолжить;
		КонецЕсли; 		
		//
		Попытка
			НЗ = РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
			НЗ.Отбор.БизнесПроцесс.Установить(СтрокаНЗ.БизнесПроцесс, Истина);
			НЗ.Отбор.Исполнитель.Установить(СтрокаНЗ.ИсходныйИсполнитель, Истина);
			НЗ.Прочитать();
		Исключение
			Продолжить;	
		КонецПопытки;
		//
		
		НЗ.Очистить();
		//Если НЗ.Количество() = 0 Тогда
			
			Запись = Нз.Добавить();	
			//
			Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
			Запись.Документ = СписокОбъектов[0].Значение;
			Запись.Исполнитель = СтрокаНЗ.ИсходныйИсполнитель;
			Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
			Запись.Порядок = 99;
			Запись.Переадресант  = СтрокаНЗ.ДействующийИсполнитель;
			Запрос1 = Новый Запрос;
			Запрос1.Текст = "ВЫБРАТЬ
			|	аДокументооборотМатрицаЗаместителейСрезПоследних.ПричинаЗамены
			|ИЗ
			|	РегистрСведений.аДокументооборотМатрицаЗаместителей.СрезПоследних КАК аДокументооборотМатрицаЗаместителейСрезПоследних
			|ГДЕ
			|	аДокументооборотМатрицаЗаместителейСрезПоследних.ЗамещаемыйСотрудник = &ЗамещаемыйСотрудник
			|	И аДокументооборотМатрицаЗаместителейСрезПоследних.ДатаОкончания >= &ТекДата
			|	И аДокументооборотМатрицаЗаместителейСрезПоследних.Период <= &ТекДата";
			Запрос1.УстановитьПараметр("ЗамещаемыйСотрудник",СтрокаНЗ.ИсходныйИсполнитель);
			Запрос1.УстановитьПараметр("ТекДата",ТекущаяДата());
			Выборка1 = Запрос1.Выполнить().Выбрать();
			Если Выборка1.Следующий()  Тогда
				Запись.Согласовано =  Выборка1.ПричинаЗамены ;
				Запись.ТекстовыйРезультат =   "Заместитель " + СтрокаНЗ.ДействующийИсполнитель;
				Запись.ПричинаПереадресации  =  Выборка1.ПричинаЗамены;
			Иначе
				Запись.Согласовано =  "Переадресовано";
				Запись.ТекстовыйРезультат =   СтрокаНЗ.ДействующийИсполнитель;
				Запись.ПричинаПереадресации  =  "Перенаправлено исполнителем " + СтрокаНЗ.ИсходныйИсполнитель;
			КонецЕсли;
		//	Запись = Нз.Добавить();	
			//
			
			Запись =  РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьМенеджерЗаписи();
			
			Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
			Запись.Документ = СписокОбъектов[0].Значение;
			Запись.Исполнитель = СтрокаНЗ.ДействующийИсполнитель;
			Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
			Запись.Порядок = 99;
			Запись.Переадресант  = Неопределено;
			Запись.Согласовано =  "Не выдана" ;
			Запись.ТекстовыйРезультат =   "Не выдана";
			Запись.ПричинаПереадресации  = "Не выдана";
			Запись.Записать(Истина);
			//Иначе
		//	Для каждого Запись Из НЗ Цикл
		//		Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
		//		Запись.Документ = СписокОбъектов[0].Значение;
		//		Запись.Исполнитель = СтрокаНЗ.ИсходныйИсполнитель;
		//		Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
		//		Запись.Порядок = 99;
		//		Запись.Переадресант  = СтрокаНЗ.ДействующийИсполнитель;
		//		Запрос1 = Новый Запрос;
		//		Запрос1.Текст = "ВЫБРАТЬ
		//		|	аДокументооборотМатрицаЗаместителейСрезПоследних.ПричинаЗамены
		//		|ИЗ
		//		|	РегистрСведений.аДокументооборотМатрицаЗаместителей.СрезПоследних КАК аДокументооборотМатрицаЗаместителейСрезПоследних
		//		|ГДЕ
		//		|	аДокументооборотМатрицаЗаместителейСрезПоследних.ЗамещаемыйСотрудник = &ЗамещаемыйСотрудник
		//		|	И аДокументооборотМатрицаЗаместителейСрезПоследних.ДатаОкончания >= &ТекДата
		//		|	И аДокументооборотМатрицаЗаместителейСрезПоследних.Период <= &ТекДата";
		//		Запрос1.УстановитьПараметр("ЗамещаемыйСотрудник",СтрокаНЗ.ИсходныйИсполнитель);
		//		Запрос1.УстановитьПараметр("ТекДата",ТекущаяДата());
		//		Выборка1 = Запрос1.Выполнить().Выбрать();
		//		Если Выборка1.Следующий()  Тогда
		//			Запись.Согласовано =  Выборка1.ПричинаЗамены ;
		//			Запись.ТекстовыйРезультат =   "Заместитель " + СтрокаНЗ.ДействующийИсполнитель;
		//			Запись.ПричинаПереадресации  =  Выборка1.ПричинаЗамены;
		//		Иначе
		//			Запись.Согласовано =  "Переадресовано";
		//			Запись.ТекстовыйРезультат =   СтрокаНЗ.ДействующийИсполнитель;
		//			Запись.ПричинаПереадресации  =  "Перенаправлено исполнителем " + СтрокаНЗ.ИсходныйИсполнитель;
		//		КонецЕсли;
		//		//
		//		Запись = Нз.Добавить();	
		//		Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
		//		Запись.Документ = СписокОбъектов[0].Значение;
		//		Запись.Исполнитель = СтрокаНЗ.ДействующийИсполнитель;
		//		Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
		//		Запись.Порядок = 99;
		//		Запись.Переадресант  = Неопределено;
		//		Запись.Согласовано =  "Не выдана" ;
		//		Запись.ТекстовыйРезультат =   "Не выдана";
		//		Запись.ПричинаПереадресации  = "Не выдана";
		//	КонецЦикла; 
		//КонецЕсли; 
		
		//Запись = Нз.Добавить();	
		//
		//Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
		//
		//Запись.Документ = СписокОбъектов[0].Значение;
		//
		//Запись.Задача = Неопределено;
		//
		//Запись.Исполнитель = СтрокаНЗ.ИсходныйИсполнитель;
		//
		//Если  СписокОбъектов[0].Значение.КонтрагентыДоговоры.Количество() > 0 Тогда
		//	
		//	Запись.ДоговорКонтрагента =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].ДоговорКонтрагента;
		//	
		//	Запись.Контрагент  =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].Контрагент;
		//	
		//КонецЕсли; 
		//
		//Если  СписокОбъектов[0].Значение.ОрганизацииПодразделения.Количество() > 0 Тогда
		//	
		//	Запись.Подразделение  = СписокОбъектов[0].Значение.ОрганизацииПодразделения[0].Подразделение;
		//	
		//КонецЕсли; 
		//
		//Запись.Сумма =  СписокОбъектов[0].Значение.СуммаДокумента;
		//
		//Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
		//
		//Запись.Выполнена = Ложь;
		//
		//Запись.Переадресант  = СтрокаНЗ.ДействующийИсполнитель;
		//
		//Запрос1 = Новый Запрос;
		//Запрос1.Текст = "ВЫБРАТЬ
		//|	аДокументооборотМатрицаЗаместителейСрезПоследних.ПричинаЗамены
		//|ИЗ
		//|	РегистрСведений.аДокументооборотМатрицаЗаместителей.СрезПоследних КАК аДокументооборотМатрицаЗаместителейСрезПоследних
		//|ГДЕ
		//|	аДокументооборотМатрицаЗаместителейСрезПоследних.ЗамещаемыйСотрудник = &ЗамещаемыйСотрудник
		//|	И аДокументооборотМатрицаЗаместителейСрезПоследних.ДатаОкончания >= &ТекДата
		//|	И аДокументооборотМатрицаЗаместителейСрезПоследних.Период <= &ТекДата";
		//Запрос1.УстановитьПараметр("ЗамещаемыйСотрудник",СтрокаНЗ.ИсходныйИсполнитель);
		//Запрос1.УстановитьПараметр("ТекДата",ТекущаяДата());
		//Выборка1 = Запрос1.Выполнить().Выбрать();
		//Если Выборка1.Следующий()  Тогда
		//	Запись.Согласовано =  Выборка1.ПричинаЗамены ;
		//	Запись.ТекстовыйРезультат =   "Заместитель " + СтрокаНЗ.ДействующийИсполнитель;
		//	Запись.ПричинаПереадресации  =  Выборка1.ПричинаЗамены;
		//Иначе
		//	Запись.Согласовано =  "Переадресовано";
		//	Запись.ТекстовыйРезультат =   СтрокаНЗ.ДействующийИсполнитель;
		//	Запись.ПричинаПереадресации  =  "Перенаправлено исполнителем " + СтрокаНЗ.ИсходныйИсполнитель;
		//КонецЕсли;
		НЗ.Записать(Истина);
		//СтрокаНЗ.ТочкаКБП	Согласование рецензентами	СправочникСсылка.аДокументооборотТочкиКорпоративныхПроцессов
	КонецЦикла; 
	

КонецПроцедуры
